package Arrays;

//ѕрограмма должна создать массив из 12 случайных целых чисел из отрезка [-10;10] таким образом, 
//чтобы отрицательных и положительных элементов там было поровну и не было нулей. 
//ѕри этом пор€док следовани€ элементов должен быть случаен (т. е. не подходит вариант, когда в
 //массиве посто€нно выпадает сначала 6 положительных, а потом 6 отрицательных чисел 
//или же когда элементы посто€нно чередуютс€ через один и пр.). ¬ывести полученный массив на экран.    

public class Task12 {

}
